{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "u1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "float32", "sparse": false, "name": "u1"}, "inbound_nodes": []}, {"name": "resp", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50], "dtype": "float32", "sparse": false, "name": "resp"}, "inbound_nodes": []}, {"name": "embedding", "class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "batch_input_shape": [null, 50], "dtype": "float32", "input_dim": 11541, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 50}, "inbound_nodes": [[["resp", 0, 0, {}]], [["u1", 0, 0, {}]]]}, {"name": "utt_lstm1", "class_name": "LSTM", "config": {"name": "utt_lstm1", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 300, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["embedding", 1, 0, {}]]]}, {"name": "resp_lstm", "class_name": "LSTM", "config": {"name": "resp_lstm", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 300, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"name": "final_concat", "class_name": "Concatenate", "config": {"name": "final_concat", "trainable": true, "dtype": "float32", "axis": 1}, "inbound_nodes": [[["utt_lstm1", 0, 0, {}], ["resp_lstm", 0, 0, {}]]]}, {"name": "dense1", "class_name": "Dense", "config": {"name": "dense1", "trainable": true, "dtype": "float32", "units": 3847, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["final_concat", 0, 0, {}]]]}, {"name": "dense2", "class_name": "Dense", "config": {"name": "dense2", "trainable": true, "dtype": "float32", "units": 11541, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense1", 0, 0, {}]]]}], "input_layers": [["u1", 0, 0], ["resp", 0, 0]], "output_layers": [["dense2", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}